382_Sustitutivas/Documentos/PruebasUAT_SolucionesNegocio/xml/AnalisisInformacion_v1/Entrada/PEOR770919FQ1_2019_0401.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pag="Pagos" xmlns:mic="http://schemas.datacontract.org/2004/07/Microsoft.Framework.Template.Modelo.Base" xmlns:sat="http://schemas.datacontract.org/2004/07/Sat.Scade.Pagos.Modelo.Dominio.Filtros" xmlns:mic1="http://schemas.datacontract.org/2004/07/Microsoft.Framework.Template.Modelo.Shared" xmlns:arr="http://schemas.microsoft.com/2003/10/Serialization/Arrays">
   <soapenv:Header/>
   <soapenv:Body>
      <pag:ConsultarPagoAnterior>
         <!--Optional:-->
         <pag:request>
            <!--Optional:-->
            <mic:Auditable>true</mic:Auditable>
            <!--Optional:-->
            <mic:ServidorOrigen>1.1.1.1</mic:ServidorOrigen>
            <!--Optional:-->
            <mic:UsuarioOperacion>usrSustitutivas</mic:UsuarioOperacion>
            <!--Optional:-->
            <mic:Item>
               <!--Optional:-->
               <sat:Banco>40002</sat:Banco>
               <!--Optional:-->
               <sat:Concepto>0401</sat:Concepto>
               <!--Optional:-->
               <sat:Ejercicio>2019</sat:Ejercicio>
               <!--Optional:-->
               <sat:FechaRecepcion>20201012</sat:FechaRecepcion>
               <!--Optional:-->
               <sat:Periodo>004</sat:Periodo>
               <!--Optional:-->
               <sat:RFC>PEOR770919FQ1</sat:RFC>
            </mic:Item>
         </pag:request>
      </pag:ConsultarPagoAnterior>
   </soapenv:Body>
</soapenv:Envelope>